README.md
```mermaid
graph LR
    subgraph "Dominio"
        M[ArchivoMetadata]
        S[FileMetadataService]
        D[DirectoryDiscoveryService]
    end

    subgraph "Puertos Entrada"
        PI[StartIndexFullUseCase]
    end

    subgraph "Adaptadores Entrada"
        AI1[BatchIndexingController]
        AI2[MonitoringController]
    end

    subgraph "Adaptadores Salida"
        AO1[DirectoryQueueItemReader]
        AO2[MetadataExtractorProcessor]
        AO3[BulkUpsertMongoItemWriter]
        AO4[CustomLazySftpSessionFactory]
    end

    AI1 --> PI
    AI2 --> PI
    PI --> S
    S --> M
    AO1 --> D
    AO1 --> AO4
    AO2 --> S
    AO3 --> MongoDB[(MongoDB)]
    AO4 --> SFTP[SFTP Server]
```
